ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/aogd/meddelelseMultiSend/ValidRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:MeddelelseMultiSend_I>
            <ns:FagsystemNavn>EFI</ns:FagsystemNavn>
            <ns:MeddelelseBatchID>${Properties#MeddelelseBatchID}</ns:MeddelelseBatchID>
            <ns:Meddelelser>
               <ns:Meddelelse>
                  <ns:MeddelelseIndhold>
                     <ns:DMIMeddelelseStandardModregningStruktur>
                        <ns:MeddelelseAfsenderDato>2016-11-23</ns:MeddelelseAfsenderDato>
                        <ns:MyndighedUdbetaling>
                           <ns:MyndighedUdbetalingTypeKode>PERS</ns:MyndighedUdbetalingTypeKode>
                           <ns:FordringHaverStruktur>
                              <ns:DMIFordringHaverID>000000000000001001</ns:DMIFordringHaverID>
                              <ns:KundeStruktur>
                                 <ns:KundeNummer>82000372</ns:KundeNummer>
                                 <ns:KundeType>SE-Virksomhed</ns:KundeType>
                                 <ns:VirksomhedCVRNummer>82000372</ns:VirksomhedCVRNummer>
                                 <ns:KundeNavn>Indenrigsministeriet</ns:KundeNavn>
                                 <ns:DriftFormKode>043</ns:DriftFormKode>
                              </ns:KundeStruktur>
                              <ns:DMIFordringHaverArt>SKA</ns:DMIFordringHaverArt>
                           </ns:FordringHaverStruktur>
                           <ns:FordringHaverAdresse>
                              <ns:AdresseStruktur>
                                 <ns:Adresse/>
                              </ns:AdresseStruktur>
                           </ns:FordringHaverAdresse>
                           <ns:MyndighedUdbetalingDato>2016-11-23</ns:MyndighedUdbetalingDato>
                           <ns:MyndighedUdbetalingBeløb>11000.00</ns:MyndighedUdbetalingBeløb>
                        </ns:MyndighedUdbetaling>
                        <ns:Modregning>
                           <ns:TransaktionDækningBeløbStruktur>
                              <ns:DMITransaktionDækningBeløb>10000.00</ns:DMITransaktionDækningBeløb>
                              <ns:DMITransaktionDækningBeløbDKK>10000.00</ns:DMITransaktionDækningBeløbDKK>
                              <ns:ValutaKode>DKK</ns:ValutaKode>
                           </ns:TransaktionDækningBeløbStruktur>
                        </ns:Modregning>
                        <ns:SpecificeretModregningListe/>
                        <ns:USpecificeretModregningListe/>
                        <ns:ÆgtefælleRestanceListe/>
                        <ns:TransportOgUdlægListe>
                           <ns:TransportEllerUdlæg>
                              <ns:DMIFordringEFIFordringID>000000100000179430</ns:DMIFordringEFIFordringID>
                              <ns:DMIFordringEFIHovedFordringID>000000100000179430</ns:DMIFordringEFIHovedFordringID>
                              <ns:TransportEllerUdlægRettighedHaver>
                                 <ns:KundeStruktur>
                                    <ns:KundeNummer>0505789539</ns:KundeNummer>
                                    <ns:KundeType>CPR-Person</ns:KundeType>
                                    <ns:KundeNavn>SKAT Inddrivelse Test Person 3951</ns:KundeNavn>
                                 </ns:KundeStruktur>
                              </ns:TransportEllerUdlægRettighedHaver>
                              <ns:AdresseBeskyttelse>false</ns:AdresseBeskyttelse>
                              <ns:TransportEllerUdlægRettighedHaverAdresse>
                                 <ns:AdresseStruktur>
                                    <ns:Adresse>
                                       <ns:AdresseFortløbendeNummer>0000000000000</ns:AdresseFortløbendeNummer>
                                       <ns:AdresseVejNavn>Havsnæsvej</ns:AdresseVejNavn>
                                       <ns:AdresseVejKode>1656</ns:AdresseVejKode>
                                       <ns:AdresseFraHusNummer>3</ns:AdresseFraHusNummer>
                                       <ns:AdressePostNummer>4900</ns:AdressePostNummer>
                                       <ns:AdressePostDistrikt>Nakskov</ns:AdressePostDistrikt>
                                       <ns:AdresseByNavn>Vesternæs</ns:AdresseByNavn>
                                       <ns:AdresseGyldigFra>2012-07-25</ns:AdresseGyldigFra>
                                       <ns:AdresseTypeKode>000</ns:AdresseTypeKode>
                                    </ns:Adresse>
                                 </ns:AdresseStruktur>
                              </ns:TransportEllerUdlægRettighedHaverAdresse>
                              <ns:DMIFordringFordringArtKode>TRAN</ns:DMIFordringFordringArtKode>
                              <ns:DMIFordringTypeKode>TUTRANX</ns:DMIFordringTypeKode>
                              <ns:TransaktionDækningBeløbStruktur>
                                 <ns:DMITransaktionDækningBeløb>4000.00</ns:DMITransaktionDækningBeløb>
                                 <ns:DMITransaktionDækningBeløbDKK>4000.00</ns:DMITransaktionDækningBeløbDKK>
                                 <ns:ValutaKode>DKK</ns:ValutaKode>
                              </ns:TransaktionDækningBeløbStruktur>
                              <ns:DMIFordringModtagelseDato>2016-11-23T13:29:00</ns:DMIFordringModtagelseDato>
                           </ns:TransportEllerUdlæg>
                           <ns:TransportEllerUdlæg>
                              <ns:DMIFordringEFIFordringID>000000100000179430</ns:DMIFordringEFIFordringID>
                              <ns:DMIFordringEFIHovedFordringID>000000100000179430</ns:DMIFordringEFIHovedFordringID>
                              <ns:TransportEllerUdlægRettighedHaver>
                                 <ns:KundeStruktur>
                                    <ns:KundeNummer>0505859146</ns:KundeNummer>
                                    <ns:KundeType>CPR-Person</ns:KundeType>
                                    <ns:KundeNavn>SKAT Inddrivelse Test Person 3944</ns:KundeNavn>
                                 </ns:KundeStruktur>
                              </ns:TransportEllerUdlægRettighedHaver>
                              <ns:AdresseBeskyttelse>false</ns:AdresseBeskyttelse>
                              <ns:TransportEllerUdlægRettighedHaverAdresse>
                                 <ns:AdresseStruktur>
                                    <ns:Adresse>
                                       <ns:AdresseFortløbendeNummer>0000000000000</ns:AdresseFortløbendeNummer>
                                       <ns:AdresseVejNavn>Ægirsgade</ns:AdresseVejNavn>
                                       <ns:AdresseVejKode>8520</ns:AdresseVejKode>
                                       <ns:AdresseFraHusNummer>123</ns:AdresseFraHusNummer>
                                       <ns:AdressePostNummer>2200</ns:AdressePostNummer>
                                       <ns:AdressePostDistrikt>København N</ns:AdressePostDistrikt>
                                       <ns:AdresseGyldigFra>2012-07-25</ns:AdresseGyldigFra>
                                       <ns:AdresseTypeKode>000</ns:AdresseTypeKode>
                                    </ns:Adresse>
                                 </ns:AdresseStruktur>
                              </ns:TransportEllerUdlægRettighedHaverAdresse>
                              <ns:DMIFordringFordringArtKode>TRAN</ns:DMIFordringFordringArtKode>
                           <ns:DMIFordringTypeKode>TUTRANX</ns:DMIFordringTypeKode>
                           <ns:TransaktionDækningBeløbStruktur>
                              <ns:DMITransaktionDækningBeløb>6000.00</ns:DMITransaktionDækningBeløb>
                              <ns:DMITransaktionDækningBeløbDKK>6000.00</ns:DMITransaktionDækningBeløbDKK>
                              <ns:ValutaKode>DKK</ns:ValutaKode>
                           </ns:TransaktionDækningBeløbStruktur>
                           <ns:DMIFordringModtagelseDato>2016-11-23T13:29:00</ns:DMIFordringModtagelseDato>
                        </ns:TransportEllerUdlæg>
                     </ns:TransportOgUdlægListe>
                     <ns:RestBeløb>
                        <ns:RestbeløbTilMyndighedMarkering>false</ns:RestbeløbTilMyndighedMarkering>
                        <ns:UdbetalingBeløbStruktur>
                           <ns:ValutaKode>DKK</ns:ValutaKode>
                           <ns:DMIUdbetalingBeløb>1000.00</ns:DMIUdbetalingBeløb>
                           <ns:DMIUdbetalingBeløbDKK>1000.00</ns:DMIUdbetalingBeløbDKK>
                        </ns:UdbetalingBeløbStruktur>
                        <ns:NemKontoUdbetalingModtagerPosteringTekst>Hanne</ns:NemKontoUdbetalingModtagerPosteringTekst>
                        <ns:AlternativUdbetalingKanalStruktur>
                           <ns:DMIUdbetalingForm>NEMKO</ns:DMIUdbetalingForm>
                           <ns:SupplerendeBankOplysningerValg>
                              <ns:NemKontoUdbetaling>
                                 <ns:DMIUdbetalingEgenNemkonto>true</ns:DMIUdbetalingEgenNemkonto>
                              </ns:NemKontoUdbetaling>
                           </ns:SupplerendeBankOplysningerValg>
                        </ns:AlternativUdbetalingKanalStruktur>
                     </ns:RestBeløb>
                  </ns:DMIMeddelelseStandardModregningStruktur>
               </ns:MeddelelseIndhold>
               <ns:MeddelelseTypeNummer>EFI16DMI3001</ns:MeddelelseTypeNummer>
               <ns:MeddelelseAfsenderReference>98</ns:MeddelelseAfsenderReference>
               <ns:KundeNummer>0505722477</ns:KundeNummer>
               <ns:MeddelelseOprettetAfMedarbejder>w19223</ns:MeddelelseOprettetAfMedarbejder>
               <ns:MeddelelseTypeSkalIKommunikationMappe>true</ns:MeddelelseTypeSkalIKommunikationMappe>
                    <ns:Filer/>
                </ns:Meddelelse>
            </ns:Meddelelser>
        </ns:MeddelelseMultiSend_I>
    </soapenv:Body>
</soapenv:Envelope>